In [35]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote
import os
from sqlalchemy.types import VARCHAR, CHAR, DECIMAL, DATE, DATETIME

In [2]:
# connection to MySQL
import pandas as pd
from urllib.parse import quote_plus as urlquote
from sqlalchemy import create_engine

username = "root"
password = "root"

connection = f"mysql+pymysql://{username}:{urlquote(password)}@localhost/movies"
engine = create_engine(connection)
conn = engine.connect()

In [12]:
# Loading in data
df_2001 = pd.read_csv("Data/final_tmdb_data_2001.csv.gz")
df_2002 = pd.read_csv("Data/final_tmdb_data_2002.csv.gz")
df_ratings = pd.read_csv('ratings.csv')
df_basics = pd.read_csv("bascis.csv")

In [14]:
df_2001.head(5)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0034413,0.0,NaN,NaN,0.0,"[{'id': 99, 'name': 'Documentary'}]",NaN,1022890.0,en,Youth Gets a Break,...,0.0,20.0,[],Released,NaN,Youth Gets a Break,0.0,0.000,0.0,NaN
2,tt0035423,0.0,/tJLV3BAlHOgscVOrA99Wnb2gAef.jpg,NaN,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",NaN,11232.0,en,Kate & Leopold,...,76019048.0,118.0,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.324,1241.0,PG-13
3,tt0114447,0.0,NaN,NaN,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",NaN,151007.0,en,The Silent Force,...,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,They left him for dead... They should have fin...,The Silent Force,0.0,5.000,3.0,NaN
4,tt0116916,0.0,/rFpHBidSlhjflmnLu7BZilyKeQR.jpg,NaN,0.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,73549.0,en,The Dark Mist,...,0.0,101.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,The Dark Mist,0.0,3.500,2.0,PG

In [15]:
df_2002.head(5)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0094718,0.0,/vQA1Dsqs9dFegvAUxqlHHuqcjq3.jpg,NaN,0.0,"[{'id': 99, 'name': 'Documentary'}]",NaN,38777.0,en,Beavers,...,0.0,31.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The biggest dam movie you ever saw.,Beavers,0.0,6.5,2.0,G
2,tt0096056,0.0,/95U3MUDXu4xSCmVLtWgargRipDi.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,109809.0,en,Crime and Punishment,...,0.0,126.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Crime and Punishment,0.0,5.3,12.0,NaN
3,tt0113506,0.0,NaN,NaN,0.0,"[{'id': 99, 'name': 'Documentary'}]",http://realityfilms.net/,212891.0,en,Justifiable Homicide,...,0.0,85.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,A mother's relentless battle for justice.,Justifiable Homicide,0.0,0.0,0.0,NaN
4,tt0118926,0.0,/qR3Dk3ctnrrxkAI6I472RhamIbu.jpg,NaN,0.0,"[{'id': 80, 'name': 'Crime'}, {'id': 18, 'name...",NaN,20689.0,en,The Dancer Upstairs,...,5227348.0,132.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"An honest man caught in a world of intrigue, p...",The Dancer Upstairs,0.0,6.2,51.0,R

In [16]:
df_basics.head(5)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,126,Drama

In [18]:
df_ratings.head(5)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1988
1  tt0000002            5.8       265
2  tt0000005            6.2      2632
3  tt0000006            5.1       182
4  tt0000007            5.4       825

In [20]:
# Normalizing genres column in basics dataframe
df_basics['genres_split'] = df_basics['genres'].str.split(',')
exploded_genres = df_basics.explode('genres_split')
unique_genres = sorted(exploded_genres['genres_split'].unique())
title_genres = exploded_genres[['tconst', 'genres_split']].rename(columns={'genres_split': 'genre'})

title_genres.head(5)

      tconst    genre
0  tt0035423   Comedy
0  tt0035423  Fantasy
0  tt0035423  Romance
1  tt0062336    Drama
2  tt0069049    Drama

In [21]:
# Create Genre Mapper Dictionary and Replace String Genres with Integer IDs:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))

title_genres['genre_id'] = title_genres['genre'].map(genre_map)
title_genres = title_genres.drop(columns='genre')

# title_genres after adding genre_id
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [22]:
genres_df = pd.DataFrame(list(genre_map.items()), columns=['genre_name', 'genre_id'])

# Display the genres_df
genres_df.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [23]:
# Save title_genres and genres tables to the MySQL database
title_genres.to_sql('title_genres', con=engine, index=False, if_exists='replace')
genres_df.to_sql('genres', con=engine, index=False, if_exists='replace')

25

In [31]:
df_2001.to_sql('tmdb_data', con=engine, if_exists='replace', index=False)

3248

In [32]:
df_2002.to_sql('tmdb_data', con=engine, if_exists='replace', index=False)

3530

In [39]:
# show tables
tables = pd.read_sql("SHOW TABLES", con=engine)
tables

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres
4        tmdb_data

In [47]:
# Show results of the DESCRIBE table query and SELECT * FROM table LIMIT 5 query
for table in tables['Tables_in_movies'].tolist():
    describe_query = pd.read_sql(f"DESCRIBE {table}", con=engine)
    select_query = pd.read_sql(f"SELECT * FROM {table} LIMIT 5", con=engine)
    
    print(f"\nDESCRIBE {table}:")
    print(describe_query)
    print(f"\nSELECT * FROM {table} LIMIT 5:")
    print(select_query)

DESCRIBE genres:
        Field    Type Null Key Default Extra
0  genre_name    text  YES        None
1    genre_id  bigint  YES        None

SELECT * FROM genres LIMIT 5:
  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

DESCRIBE ratings:
             Field         Type Null  Key Default Extra
0           tconst     char(12)   NO  PRI    None
1   average_rating  varchar(45)  YES         None
2  number_of_votes          int  YES         None

SELECT * FROM ratings LIMIT 5:
      tconst average_rating  number_of_votes
0  tt0000001            5.7             1988
1  tt0000002            5.8              265
2  tt0000005            6.2             2632
3  tt0000006            5.1              182
4  tt0000007            5.4              825

DESCRIBE title_basics:
           Field          Type Null  Key Default Extra
0         tconst      char(12)   NO  PRI    None
1  primary_title  varchar(255)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

SELECT * FROM title_basics LIMIT 5:
    tconst                             primary_title  start_year  runtime
0  1000017                              Torture Room        2007       83
1  1000020                                 Windstorm        2007       77
2  1000070      Billy & Mandy's Big Boogey Adventure        2007       80
3  1000095  PokÃ©mon Ranger and the Temple of the Sea        2006      105
4  1000106                                 Indelible        2007      107

DESCRIBE title_genres:
      Field    Type Null Key Default Extra
0    tconst    text  YES        None
1  genre_id  bigint  YES        None

SELECT * FROM title_genres LIMIT 5:
      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

DESCRIBE tmdb_data:
                    Field    Type Null Key Default Extra
0                 imdb_id    text  YES        None
1                   adult  double  YES        None
2           backdrop_path    text  YES        None
3   belongs_to_collection    text  YES        None
4                  budget  double  YES        None
5                  genres    text  YES        None
6                homepage    text  YES        None
7                      id  double  YES        None
8       original_language    text  YES        None
9          original_title    text  YES        None
10               overview    text  YES        None
11             popularity  double  YES        None
12            poster_path    text  YES        None
13   production_companies    text  YES        None
14   production_countries    text  YES        None
15           release_date    text  YES        None
16                revenue  double  YES        None
17                runtime  double  YES        None
18       spoken_languages    text  YES        None
19                 status    text  YES        None
20                tagline    text  YES        None
21                  title    text  YES        None
22                  video  double  YES        None
23           vote_average  double  YES        None
24             vote_count  double  YES        None
25          certification    text  YES        None

SELECT * FROM tmdb_data LIMIT 5:
     imdb_id  adult                     backdrop_path belongs_to_collection  \
0          0    NaN                              None                  None
1  tt0094718    0.0  /vQA1Dsqs9dFegvAUxqlHHuqcjq3.jpg                  None
2  tt0096056    0.0  /95U3MUDXu4xSCmVLtWgargRipDi.jpg                  None
3  tt0113506    0.0                              None                  None
4  tt0118926    0.0  /qR3Dk3ctnrrxkAI6I472RhamIbu.jpg                  None

   budget                                             genres  \
0     NaN                                               None
1     0.0                [{'id': 99, 'name': 'Documentary'}]
2     0.0                      [{'id': 18, 'name': 'Drama'}]
3     0.0                [{'id': 99, 'name': 'Documentary'}]
4     0.0  [{'id': 80, 'name': 'Crime'}, {'id': 18, 'name...

                   homepage        id original_language        original_title  \
0                      None       NaN              None                  None
1                      None   38777.0                en               Beavers
2                      None  109809.0                en  Crime and Punishment
3  http://realityfilms.net/  212891.0                en  Justifiable Homicide
4                      None   20689.0                en   The Dancer Upstairs

   ...    revenue  runtime                                   spoken_languages  \
0  ...        NaN      NaN                                               None
1  ...        0.0     31.0  [{'english_name': 'English', 'iso_639_1': 'en'...
2  ...        0.0    126.0  [{'english_name': 'English', 'iso_639_1': 'en'...
3  ...        0.0     85.0  [{'english_name': 'English', 'iso_639_1': 'en'...
4  ...  5227348.0    132.0  [{'english_name': 'English', 'iso_639_1': 'en'...

     status                                            tagline  \
0      None                                               None
1  Released                The biggest dam movie you ever saw.
2  Released                                               None
3  Released          A mother's relentless battle for justice.
4  Released  An honest man caught in a world of intrigue, p...

                  title  video  vote_average vote_count certification
0                  None    NaN           NaN        NaN          None
1               Beavers    0.0           6.5        2.0             G
2  Crime and Punishment    0.0           5.3       12.0          None
3  Justifiable Homicide    0.0           0.0        0.0          None
4   The Dancer Upstairs    0.0           6.2       51.0             R

[5 rows x 26 columns]

In [48]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

AttributeError: 'Engine' object has no attribute 'execute'